{
  "CharacterClass": [
    {
      "cClass": "Bard",
      "description": "Bards are jack-of-all-trades adventurers who use songs to create a wide variety of magical effects. Though they often use melee weapons, bards are primarily a magic-using class, with the ability to wear plate armor and wield many different types of weapons and instruments. Bards can do a little bit of everything. Their songs can regenerate health and mana, increase attack speed and accuracy, momentarily charm angry enemies, help friends resist many types of damage and even directly damage enemies. Bards are perhaps best known, however, for their ability to greatly increase the foot speed of their group. Bards have the unique ability to create multiple effects at once. By weaving different songs together, a bard can customize effects to any situation. This makes nimble fingers and quick thinking a must for those who want to play a bard. Bards do well both alone and in groups. With the right combination of songs, they can adapt to many different challenges. The bard is a great class for players who enjoy a wide variety of play options but are quick to adapt to a changing situation.",
      "url": "/img/C_bard.gif",
      "posts": []
    },
    {
      "cClass": "Cleric",
      "description": "Clerics dedicate their lives to the gods of Norrath, gaining magical powers in exchange for their faith and service. Clerics are primarily a magic-using class, with the ability to wear plate armor and wield blunt weapons.Clerics gain powerful healing and enhancement spells, greatly increasing the health and defenses of their group, while keeping them healed in the most dangerous battles. While other priest classes have healing spells, no one can match up with the power and efficiency of clerical healing. Clerics are potent enemies of the undead, able to channel their holy fervor into highly destructive banishment spells. Resurrection is also the domain of the cleric, allowing them to bring their fallen companions back from the dead without the normal penalties for death. With a few exceptions, clerics are dependent on being part of a group. But they are highly desirable group members. An experienced cleric is a great benefit to any group and is an excellent choice for the social player.",
      "url": "/img/C_cleric.gif",
      "posts": []
    },
    {
      "cClass": "Druid",
      "description": "Druids are disciples of the wilds, following the teachings of the Norrathian gods of nature. Druids are primarily a magic-using class, with the ability to wear leather armor and wield blunt weapons and scimitars. Druidic magic takes many forms, allowing the druid to fill a wide variety of roles when in a group or adventuring alone. Druids possess fair healing abilities, powerful health regenerative spells, valuable enhancements that improve the health and armor of their group, and at max level considerable mana regenerative spells. Offensively, druids are versatile. They have access to fire and cold-based damage spells, a selection of disease and swarm spells that damage their enemies over time, powerful banishment spells focused upon unnaturally summoned creatures, and spells to charm animals. Druids also gain some of the best travel spells, including the ability to speed up their group's movement and teleport their group to distant regions. Druids are a well-rounded class, prospering in both solo and grouped situations. An experienced druid is able to adventure alone, but is equally at home in a group. The druid is an excellent class for players who enjoy a variety of play styles and options. Druids make one of the best starting characters in EQ due to their amazing ability to make money via teleports, item farming, versatility, ease of travel, and quad killing giants. Druid tracking is capped at 20 at launch, and raised to 50 come Plane of Sky patch. It is later raised to 125 months after Velious release.",
      "url": "/img/C_druid.gif",
      "posts": []
    },
    {
      "cClass": "Enchanter",
      "description": "Enchanters are the most subtle of spell casters, with little focus on doing damage directly but tremendous impact on the world around them. Enchanters are primarily a magic-using class, with the ability to wear cloth armor and wield blunt weapons and daggers. Enchanters specialize on improving the minds of their allies, with unmatched mana regeneration spells and mental enhancements. Haste spells are also the domain of the enchanter, providing incredible boosts in attack speed for members of their group. Enchanters have many powers of illusion as well, allowing them to take the form of many different creatures and races. In battle, enchanters are able to bring order to chaotic situations, often saving their group in a fight that would otherwise be lost. Enchanters possess the ability to mesmerize their enemies, temporarily removing them from a battle. Attack slowing spells are also a specialty, dramatically lowering the speed of a monster's attacks for a period of time. In many situations, enchanters can call upon powerful charm spells to subjugate the mind of a monster and command it to do the enchanter's bidding. Enchanters are a powerful class, but often rely upon a group to reach their full potential. Experienced enchanters thrive in chaotic situations where they can make the most of their offensive abilities. The enchanter is a good choice for players who enjoy playing in groups and like to take charge of challenging situations.",
      "url": "/img/C_enchanter.gif",
      "posts": []
    },
    {
      "cClass": "Magician",
      "description": "Magicians are master summoners, able to call elemental pets to do their bidding and to conjure useful items from thin air. Magicians are primarily a magic-using class, with the ability to wear cloth armor and wield blunt weapons and daggers. Elemental pets are at the heart of a magician's offensive strategy, and typically accompany a magician in all his adventures. This pet provides protection for its master, along with powerful attacks and special abilities. Magicians have a large selection of fire and magic-based damage spells, allowing them to mount a damaging magical assault in support of their elemental pet. Magicians have a wide range of summoning spells, allowing them to conjure such diverse items as food, weapons, armor, and magical jewelry. In battle, the magician can encase his entire group in a shield of fire, damaging any opponent that strikes them. Magicians also have spells that lower a monster's resistance to magic, allowing spells to damage them more easily. Magicians are a very focused class, sacrificing some diversity for power in their area of expertise. Magicians are able to adventure solo, but also provide value in a group situation. The magician is a good choice for players who enjoy managing a powerful pet and using a tightly focused spell selection.",
      "url": "/img/C_magician.gif",
      "posts": []
    },
    {
      "cClass": "Monk",
      "description": "Monks devote their energies to the pursuit of physical perfection, shaping their very bodies into deadly machines and building strength with pure will. They are renowned fighters with bodies of steel, frightening even the strongest of opponents. Monks are a melee class with the ability to wear leather armor, wield blunt weapons, and use unarmed combat styles. Monks forego heavy armor and almost all weapons in order to hone themselves into masters of combat, using their fists and a stout staff to make their mark upon Norrath. Monks learn many special attacks to enhance their damage dealing abilities, including the dragon punch and the legendary flying kick. In their martial studies monks also learn other useful skills, including the ability to move silently and fall safely from great heights. Experienced monks also learn to feign death, slowing their body's functions enough to fool most observers into believing them dead - this trick often allows the monk to escape dangerous situations as monsters wander off, thinking the monk defeated. Monks are a specialist class, focusing on physical combat to the exclusion of all else. Monks provide a powerful ally in a group, though it's not unusual to see a monk adventuring alone. The monk is a good choice for players who enjoy a strong offensive role in combat and leading groups in their dungeon adventures.",
      "url": "/img/C_monk.gif",
      "posts": []
    },
    {
      "cClass": "Necromancer",
      "description": "Necromancers are masters of life and death, utilizing fire, magic, poison, and disease based spells to overwhelm their foes and assist their allies. Their choice to descend into necromancy has alienated them from most old-world civilizations, being killed on sight by most guards and shunned by many merchants. As such, the necromancer is very independent; few support classes are able to offer anything that the necromancer does not already have, and items and gear do not carry the same weight as they do for other classes. The necromancer's power comes from a deep understanding of the powers of life and death. This grants them a number of abilities, including the ability to mezmerize, snare, and fear their enemies, to transfer mana and health to their allies, and lastly to assert their dominance over the undead with a number of efficient direct damage, charm, root and lull spells. The necromancer is classified as anti-natural and has some unique spells to attack animals and plant based mobs. Highlights of the Necromancer are their powerful pets, the most efficient Damage over Time (DoT) spells of any class along with their snare, fear, and root powers, Necromancers are very powerful soloers. Their ability to charm an even more powerful undead pet at higher levels gives them yet another strong soloing option. Plus, they can combine their fear and Feign Death powers to split individual mobs away from the group and of course Feign Death itself provides a way to survive, even without a group, when things go wrong. Although these spells are slower, doing damage only once every 6 second tick for a period of time, they use up far less mana than faster nukes. DoT spells are significantly more mana efficient than DD (Direct Damage) spells. Necromancers also have access to one of the most powerful mana regenerating abilities in the game: the Lich line of spells. These grant a buff that slowly drains their HP, but in exchange it provides significantly faster mana regeneration ... allowing for even more efficient soloing (while also being useful in other circumstances too). The line begins with Dark Pact, and when it reaches Call of Bones the Necromancer's skin melts away, turning them into a skeleton. In groups, and especially on raids, Necromancers rely on their DoTs less. They still deal damage (mainly through their pet), and also transfer health and mana to teammates and provide other utility functions.",
      "url": "/img/C_necromancer.gif",
      "posts": []
    },
    {
      "cClass": "Paladin",
      "description": "Paladins are holy warriors who use blessed spells and strength of arms to fight the evil and undead of Norrath. Paladins are primarily a melee class, able to wear plate armor and wield many kinds of weapons. Paladins are able fighters and battlefield healers whose combat spells focus on stunning enemies and smiting undead. They also have several spells that increase the health and armor of their allies. Every so often, paladins can lay hands on themselves or their friends to instantly grant a powerful heal. Paladins are the greatest force against undead. At higher levels they gain special abilities to smite these foes. Paladins also gain a limited ability to resurrect their fallen friends with lessened penalties for death. Paladins can sometimes work alone, healing themselves with magic, but in a group a paladin really shines, going head to head with his enemies and occasionally falling back to heal. Players who like to engage in melee fights but want the options spells provide will find paladins a great class to play.",
      "url": "/img/C_paladin.gif",
      "posts": []
    },
    {
      "cClass": "Ranger",
      "description": "Part Warrior, part Druid, the ranger is a hybrid class combining the combat skills and the magical abilities. Rangers are a lightly armored offensive class which focuses more on delivering damage than tanking. In terms of combat skills they can use all types of weapons and get dual wield, double attack, and kick. They also get a number of defensive skills including dodge, parry, riposte and disarm. However, because they are a hybrid class Rangers learn most of these combat skills a few levels later than pure melee classes. Rangers have higher offensive skill caps than any other hybrid class. However, they are lower in a number of defensive skill areas. They have a lower skill cap on taunt, riposte, disarm, dodge and parry compared to Warriors, and slightly below the Paladin and Shadow Knight class on some of these. As light tanks, with some of the best aggro inducing abilities in the game, they can but should not be left to tank for significant periods. They have no skill to reduce the monsters hate for them until the Kunark expansion in the form of the spell Jolt. Rangers get the highest tracking skill in the game, which helps to find people or enemies within the area. This is particularly useful in the large outdoor zones of Kunark. Rangers are one of only two classes that can do critical blows with archery starting at level 12. However, this skill is only useful in limited circumstances before the Velious expansion by way of the Trueshot Discipline. In the Luclin expansion archery becomes significantly more viable for the class due to Alternative Advancement abilities. In terms of magic Rangers get a range of nice utility spells. They receive both Spirit of Wolf and later take the form of a wolf benefiting from both run speed and a significant ATK bonus. They also get spells to reduce monster frenzy ranges, and this enables them to single pull out of a group. They have both healing spells and damage shields (the latter of which inflicts unresistable damage). This is coupled with a solid series of HP and AC increasing buffs, as well as some minor stat buffs. Damage wise they receive both direct damage and damage over time spells. They can also snare and root mobs. Despite their magical power they do not have the ability to bind or gate. You can view the full ranger spell list here. A challenge playing the ranger class can often be aggro management and staying alive. Rangers can draw monster aggro easily through their damage output in combination with their fire damage over time spells, which generate a lot of aggro. This makes them shine having high snap aggro when the situation calls for it. But when it does not their lower armor class, hit points and defense capabilities compared to tank classes can get them into trouble. If you are looking for a class with decent damage output, the best tracking in the game, and a little bit of magic to spice things up this class could be the one for you. You will be able to deal damage, spot heal, and act as a light tank in group content. Just be warned that your road to 60 could be challenging, as rangers often have lower priority on group invites for the damage role, and struggle to tank effectively in post level fifty content. This class is not for the faint of heart, but still versatile and fun nonetheless bringing value by adapting and utilizing all it's abilities.",
      "url": "/img/C_ranger.gif",
      "posts": []
    },
    {
      "cClass": "Rogue",
      "description": "Rogues are the stealthy thieves and vicious assassins that stalk the shadows of Norrath. Rogues are primarily a melee class, able to wear chain armor and use piercing, slashing and some blunt weapons. Rogues are sneaky fighters who always seek to take advantage of enemies by attacking from behind. Rogues can backstab enemies for extra damage, using poisoned weapons for added effect. Rogues can detect traps, pick locks and pockets, and fall safely from great heights. Rogues are known for their ability to sneak and hide. This allows them to move almost anywhere, exploring the dangers that lie ahead. Combined with rogue items that use illusions, rogues make excellent scouts. Rogues are a specialist class that works best with a group of friends. Rogues can add greatly to the killing power of a group. The rogue is a good choice for players who like to do heavy damage while walking the dangerous edge of dungeon exploration. Just keep in mind being the best damage dealer comes at the cost of being extremely group dependent.",
      "url": "/img/C_rogue.gif",
      "posts": []
    },
    {
      "cClass": "Shadowknight",
      "description": "Shadow Knights are unholy warriors that use fear, pain and disease to attack all that is good in the world. Shadow Knights are a plate-wearing melee class able to wield many kinds of weapons and dark spells. The Shadow Knight is considered by many as the opposite to a Paladin, while in some ways this is true, on Norrath they aren't the traditional evil Black Knight to the Good White Knight. The races that are capable of producing Shadow Knights are not all innately evil, even Humans are known to become them. In a similar fashion to a Paladin, Shadow Knights have to be dedicated to their deity, whether this dedication is because of a desire to serve or to gain in power and wealth is debatable. What is true for certain is none of the deities Shadow Knights follow could be thought of as good and will usually be classed as evil. Shadow Knights have many of the skills and undertake similar training to that of a Warrior, complemented with an impressive spell casting ability in Necromantic magic. They are one of the most respected and feared professions and as individuals are formidable opponents, even inexperienced Shadow Knights have completed tough and painful tasks, proving their worth enough to be trained. The Iksar especially give difficult tasks to their young apprentices, many of whom will never make it beyond their apprentice status. They are taught to fight without fear or mercy and not to question their masters, at least not until they can defeat them and give commands of their own. Shadow Knights have no qualms about their method of defeating an opponent, including leaching their health and strength to enhance their own. Among the dark spells available to them, Shadow Knights can cause an enemy to run in fear and then slow their movement, catching up and striking them repeatedly where their armor is most vulnerable. This isn't to say Shadow Knights avoid direct combat as they are powerful duelists, often using weapons imbued with cruelty. They are among the most dangerous enemies that an adventurer could encounter and as an ally need to be respected and dealt with carefully, Shadow Knights have a reputation for being quick to anger and easy to annoy and not always making their distaste known until it maybe fatal for the party responsible.",
      "url": "/img/C_shadowknight.gif",
      "posts": []
    },
    {
      "cClass": "Shaman",
      "description": "The Shaman is one of the most understated classes in Norrath. They are well rounded offering powerful offensive and defensive spells as well as buffs. With the exceptions of the Iksar, Shamans can wear two types of plate armours in the world of Norrath. Iksars can't since it chafes their scales, and must resort to chain-mail or the special Iksar armours they have crafted over time. This affords them a high amount of protection, which helps greatly when soloing. Shamans have two forms of offense. Their most powerful damage lies through the damage over time spells (DOT's). Shamans get two powerful lines of these spells. One poison based, and the other disease based. They can stack these spells to achieve efficient damage output. Alternatively they can also use their cold damage based direct damage spells. These are good for adding in a little extra punch, or for fights of short durations. In terms of defense and debuffs, Shamans have the most powerful Slowing Spells and Resistance debuffs in the game. This greatly reduces the damage output of the enemy and also assists the entire party in succeeding on magical attacks. Shamans also have the best buffs in the game, able to increase all statistics except for Wisdom and Intelligence by over 50 points at higher levels. This not only makes them highly sought after in groups, but means that the shamans can be a lot more selective in what equipment they choose to wear. They also have spells to increase running speed and attack rate, as well as increasing hitpoints and AC. Shamans can use almost any one or two handed blunt weapon in the game, and have a limited selection of piercing weapons at their disposal also. Shamans can melee reasonably well with their buffs up, and with a pet at their side are capable of doing some serious damage. Downtime is also minimised with Shamans with both a health regeneration spell, direct healing spells, and a hitpoint to mana conversion spell. Shamans are the only class which can do Alchemy, a trade skill which can help in funding the purchase of spells or equipment as your character progresses. The downside to Shamans is that they can get repetitive. With so many awesome buffs at their disposal they are always getting begged for spells. In dungeon raids their main purposes are buffing and debuffing, with little mana left for damage. Most of the Shaman races are evil, which can make banking and resupplying cumbersome. In order to be mana efficient Shamans normally use Damage Over Time spells. This normally results in kiting or a drawn out process of rooting and DOT'ing. These strategies are ineffective against caster mobs which have offensive capability even while rooted. Shaman's can only charm animals up to mid levels, and they only get a few pet upgrades. The shaman class is an enjoyable one to play, particularly for those who enjoy role-playing. It is a self-sufficient class, which functions excellently both as a soloist or in a group.",
      "url": "/img/C_shaman.gif",
      "posts": []
    },
    {
      "cClass": "Warrior",
      "description": "Warriors are the masters of armed combat and defense, taking the point in battles and going head-to-head with the most dangerous creatures of Norrath. Warriors are a melee class with the ability to wear plate armor and wield all types of weapons. Warriors build their strength and stamina to unheard of levels, making them far hardier than any other class. When combined with their heavy armor and excellent defensive skills, warriors are unmatched in their ability to survive the most brutal battles. Warriors train themselves in the skills of combat, mastering the use of all weapons and tactics. Warriors also learn to taunt their opponents, making themselves the focus of all their enemies' attacks, allowing the less resilient members of their group to remain safe from harm. Warriors are often the cornerstone of a good group, providing a strong defense while also dealing heavy damage to their enemies. Warriors fare poorly when adventuring alone, and are an excellent choice for those who enjoy grouping and taking the front line in battle.",
      "url": "/img/C_warrior.gif",
      "posts": []
    },
    {
      "cClass": "Wizard",
      "description": "Wizards dedicate their lives to learning the powers of fire, ice, and magic; channeling their knowledge into ever more destructive spells to unleash upon their enemies. Wizards are primarily a magic-using class, with the ability to wear cloth armor and wield blunt weapons and daggers. Wizards are the most single-minded of spell casters, with the majority of their spells dedicated to delivering massive amounts of damage as rapidly as possible. To aid in their constant search for power, wizard have also perfected the art of teleportation - allowing them to instantly transport themselves and their allies to the most remote corners of Norrath and beyond. Wizards are a tightly focused class, gaining the greatest ability to deal magical damage in exchange for limited variety in their spell selection. Wizards are capable adventurers solo once they are able to quad kite at level 29. Wizard generally get left out of groups among min maxers due to Wizards suffering mana issues with fast killing groups. Ironically the worse a group is the more a Wizard excels, since they are able to meditate more often and therefore contribute. Play Wizard if you value burst damage and prefer to solo and/or raid.",
      "url": "/img/C_wizard.gif",
      "posts": []
    }
  ]
}